# Merging Techniques with Pandas

In [2]:
import pandas as pd

# DataFrame 1 - Student Names
df_students = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
})

# DataFrame 2 - Student Marks
df_marks = pd.DataFrame({
    'ID': [3, 4, 5, 6],
    'Marks': [85, 92, 78, 88]
})

# df_students, df_marks

In [3]:
df_students

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [4]:
df_marks

   ID  Marks
0   3     85
1   4     92
2   5     78
3   6     88

## 1. Inner Join (Only common IDs in both)

In [5]:
pd.merge(df_students, df_marks, on='ID', how='inner')

   ID     Name  Marks
0   3  Charlie     85
1   4    David     92

## 2. Left Join (All from df_students)

In [7]:
pd.merge(df_students, df_marks, on='ID', how='left')

   ID     Name  Marks
0   1    Alice    NaN
1   2      Bob    NaN
2   3  Charlie   85.0
3   4    David   92.0

## 3. Right Join (All from df_marks)

In [8]:
pd.merge(df_students, df_marks, on='ID', how='right')

   ID     Name  Marks
0   3  Charlie     85
1   4    David     92
2   5      NaN     78
3   6      NaN     88

## 4. Outer Join (All IDs from both)

In [6]:
pd.merge(df_students, df_marks, on='ID', how='outer')

   ID     Name  Marks
0   1    Alice    NaN
1   2      Bob    NaN
2   3  Charlie   85.0
3   4    David   92.0
4   5      NaN   78.0
5   6      NaN   88.0

### Summary Table
| Join Type | Keeps Rows From       | Missing Fills     |
|-----------|------------------------|-------------------|
| Inner     | Only matched IDs       | Discards rest     |
| Left      | All from df_students   | NaN on Marks      |
| Right     | All from df_marks      | NaN on Name       |
| Outer     | All from both          | NaN as needed     |